Revit 2027 API
ElectricalAnalyticalNode.GetAnalyticalPropertyData Method
 Gets the electrical analytical node property data, null if not available.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalyticalDistributionNodePropertyData GetAnalyticalPropertyData()
Public Function GetAnalyticalPropertyData As AnalyticalDistributionNodePropertyData
public:
AnalyticalDistributionNodePropertyData^ GetAnalyticalPropertyData()
member GetAnalyticalPropertyData : unit -> AnalyticalDistributionNodePropertyData
Return Value
AnalyticalDistributionNodePropertyData
 The electrical analytical node property data.
Remarks
 These types have special data:
Bus
TransferSwitch
EquipmentLoad
See Also
Reference
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace